ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>TIMx_CCDAT2</name>
  <displayName>TIMx_CCDAT2</displayName>
  <description>TIMx_CCDAT2</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT2</name>
      <description>CCDAT2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCDAT3</name>
  <displayName>TIMx_CCDAT3</displayName>
  <description>TIMx_CCDAT3</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT3</name>
      <description>CCDAT3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCDAT4</name>
  <displayName>TIMx_CCDAT4</displayName>
  <description>TIMx_CCDAT4</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT4</name>
      <description>CCDAT4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_BKDT</name>
  <displayName>TIMx_BKDT</displayName>
  <description>TIMx_BKDT</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DTGN</name>
      <description>DTGN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>LCKCFG</name>
      <description>LCKCFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>OSSI</name>
      <description>OSSI</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OSSR</name>
      <description>OSSR</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKEN</name>
      <description>BKEN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKP</name>
      <description>BKP</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AOEN</name>
      <description>AOEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MOEN</name>
      <description>MOEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_DCTRL</name>
  <displayName>TIMx_DCTRL</displayName>
  <description>TIMx_DCTRL</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00001f1f</resetMask>
  <fields>
    <field>
      <name>DBADDR</name>
      <description>DBADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>DBLEN</name>
      <description>DBLEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_DADDR</name>
  <displayName>TIMx_DADDR</displayName>
  <description>TIMx_DADDR</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>BURST</name>
      <description>BURST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCMOD3</name>
  <displayName>TIMx_CCMOD3</displayName>
  <description>TIMx_CCMOD3</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000fcfc</resetMask>
  <fields>
    <field>
      <name>OC5FEN</name>
      <description>OC5FEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC5PEN</name>
      <description>OC5PEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC5MD</name>
      <description>OC5MD</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC5CEN</name>
      <description>OC5CEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC6FEN</name>
      <description>OC6FEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC6PEN</name>
      <description>OC6PEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC6MD</name>
      <description>OC6MD</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC6CEN</name>
      <description>OC6CEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>TIMx_CCDAT5</name>
  <displayName>TIMx_CCDAT5</displayName>
  <description>TIMx_CCDAT5</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT5</name>
      <description>CCDAT5</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>TIMx_CCDAT6</name>
  <displayName>TIMx_CCDAT6</displayName>
  <description>TIMx_CCDAT6</description>
  <addressOffset>0x5C</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT6</name>
      <description>CCDAT6</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
