ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>CAN_TMDT2</name>
  <displayName>CAN_TMDT2</displayName>
  <description>CAN_TMDT2</description>
  <addressOffset>0x1a4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff010f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>TGT</name>
      <description>TGT</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDL2</name>
  <displayName>CAN_TMDL2</displayName>
  <description>CAN_TMDL2</description>
  <addressOffset>0x1a8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA0</name>
      <description>DATA0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA1</name>
      <description>DATA1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA2</name>
      <description>DATA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA3</name>
      <description>DATA3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDH2</name>
  <displayName>CAN_TMDH2</displayName>
  <description>CAN_TMDH2</description>
  <addressOffset>0x1ac</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA4</name>
      <description>DATA4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA5</name>
      <description>DATA5</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA6</name>
      <description>DATA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA7</name>
      <description>DATA7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMI0</name>
  <displayName>CAN_RMI0</displayName>
  <description>CAN_RMI0</description>
  <addressOffset>0x1b0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xfffffffe</resetMask>
  <fields>
    <field>
      <name>RTRQ</name>
      <description>RTRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDE</name>
      <description>IDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTID</name>
      <description>EXTID</description>
      <bitOffset>3</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
    <field>
      <name>STDID</name>
      <description>STDID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDT0</name>
  <displayName>CAN_RMDT0</displayName>
  <description>CAN_RMDT0</description>
  <addressOffset>0x1b4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffff0f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>FMI</name>
      <description>FMI</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDL0</name>
  <displayName>CAN_RMDL0</displayName>
  <description>CAN_RMDL0</description>
  <addressOffset>0x1b8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA0</name>
      <description>DATA0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA1</name>
      <description>DATA1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA2</name>
      <description>DATA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA3</name>
      <description>DATA3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDH0</name>
  <displayName>CAN_RMDH0</displayName>
  <description>CAN_RMDH0</description>
  <addressOffset>0x1bc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA4</name>
      <description>DATA4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA5</name>
      <description>DATA5</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA6</name>
      <description>DATA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA7</name>
      <description>DATA7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMI1</name>
  <displayName>CAN_RMI1</displayName>
  <description>CAN_RMI1</description>
  <addressOffset>0x1c0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xfffffffe</resetMask>
  <fields>
    <field>
      <name>RTRQ</name>
      <description>RTRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDE</name>
      <description>IDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTID</name>
      <description>EXTID</description>
      <bitOffset>3</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
    <field>
      <name>STDID</name>
      <description>STDID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDT1</name>
  <displayName>CAN_RMDT1</displayName>
  <description>CAN_RMDT1</description>
  <addressOffset>0x1c4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffff0f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>FMI</name>
      <description>FMI</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDL1</name>
  <displayName>CAN_RMDL1</displayName>
  <description>CAN_RMDL1</description>
  <addressOffset>0x1c8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA0</name>
      <description>DATA0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA1</name>
      <description>DATA1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA2</name>
      <description>DATA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA3</name>
      <description>DATA3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RMDH1</name>
  <displayName>CAN_RMDH1</displayName>
  <description>CAN_RMDH1</description>
  <addressOffset>0x1cc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA4</name>
      <description>DATA4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA5</name>
      <description>DATA5</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA6</name>
      <description>DATA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA7</name>
      <description>DATA7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_FMC</name>
  <displayName>CAN_FMC</displayName>
  <description>CAN_FMC</description>
  <addressOffset>0x200</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000001</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>FINITM</name>
      <description>FINITM</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_FM1</name>
  <displayName>CAN_FM1</displayName>
  <description>CAN_FM1</description>
  <addressOffset>0x204</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>FB</name>
      <description>FB</description>
      <bitOffset>0</bitOffset>
      <bitWidth>14</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_FS1</name>
  <displayName>CAN_FS1</displayName>
  <description>CAN_FS1</description>
  <addressOffset>0x20c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>FSC</name>
      <description>FSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>14</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_FFA1</name>
  <displayName>CAN_FFA1</displayName>
  <description>CAN_FFA1</description>
  <addressOffset>0x214</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>FAF</name>
      <description>FAF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>14</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_FA1</name>
  <displayName>CAN_FA1</displayName>
  <description>CAN_FA1</description>
  <addressOffset>0x21c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>FAC</name>
      <description>FAC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>14</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F0B1</name>
  <displayName>CAN_F0B1</displayName>
  <description>CAN_F0B1</description>
  <addressOffset>0x240</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F0B2</name>
  <displayName>CAN_F0B2</displayName>
  <description>CAN_F0B2</description>
  <addressOffset>0x244</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F1B1</name>
  <displayName>CAN_F1B1</displayName>
  <description>CAN_F1B1</description>
  <addressOffset>0x248</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F1B2</name>
  <displayName>CAN_F1B2</displayName>
  <description>CAN_F1B2</description>
  <addressOffset>0x24c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F2B1</name>
  <displayName>CAN_F2B1</displayName>
  <description>CAN_F2B1</description>
  <addressOffset>0x250</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F2B2</name>
  <displayName>CAN_F2B2</displayName>
  <description>CAN_F2B2</description>
  <addressOffset>0x254</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F3B1</name>
  <displayName>CAN_F3B1</displayName>
  <description>CAN_F3B1</description>
  <addressOffset>0x258</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F3B2</name>
  <displayName>CAN_F3B2</displayName>
  <description>CAN_F3B2</description>
  <addressOffset>0x25c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F4B1</name>
  <displayName>CAN_F4B1</displayName>
  <description>CAN_F4B1</description>
  <addressOffset>0x260</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F4B2</name>
  <displayName>CAN_F4B2</displayName>
  <description>CAN_F4B2</description>
  <addressOffset>0x264</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F5B1</name>
  <displayName>CAN_F5B1</displayName>
  <description>CAN_F5B1</description>
  <addressOffset>0x268</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F5B2</name>
  <displayName>CAN_F5B2</displayName>
  <description>CAN_F5B2</description>
  <addressOffset>0x26c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F6B1</name>
  <displayName>CAN_F6B1</displayName>
  <description>CAN_F6B1</description>
  <addressOffset>0x270</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F6B2</name>
  <displayName>CAN_F6B2</displayName>
  <description>CAN_F6B2</description>
  <addressOffset>0x274</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F7B1</name>
  <displayName>CAN_F7B1</displayName>
  <description>CAN_F7B1</description>
  <addressOffset>0x278</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F7B2</name>
  <displayName>CAN_F7B2</displayName>
  <description>CAN_F7B2</description>
  <addressOffset>0x27c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F8B1</name>
  <displayName>CAN_F8B1</displayName>
  <description>CAN_F8B1</description>
  <addressOffset>0x280</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F8B2</name>
  <displayName>CAN_F8B2</displayName>
  <description>CAN_F8B2</description>
  <addressOffset>0x284</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F9B1</name>
  <displayName>CAN_F9B1</displayName>
  <description>CAN_F9B1</description>
  <addressOffset>0x288</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F9B2</name>
  <displayName>CAN_F9B2</displayName>
  <description>CAN_F9B2</description>
  <addressOffset>0x28c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F10B1</name>
  <displayName>CAN_F10B1</displayName>
  <description>CAN_F10B1</description>
  <addressOffset>0x290</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F10B2</name>
  <displayName>CAN_F10B2</displayName>
  <description>CAN_F10B2</description>
  <addressOffset>0x294</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F11B1</name>
  <displayName>CAN_F11B1</displayName>
  <description>CAN_F11B1</description>
  <addressOffset>0x298</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F11B2</name>
  <displayName>CAN_F11B2</displayName>
  <description>CAN_F11B2</description>
  <addressOffset>0x29c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

