ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>CAN_F12B1</name>
  <displayName>CAN_F12B1</displayName>
  <description>CAN_F12B1</description>
  <addressOffset>0x2A0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F12B2</name>
  <displayName>CAN_F12B2</displayName>
  <description>CAN_F12B2</description>
  <addressOffset>0x2A4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>

<register>
  <name>CAN_F13B1</name>
  <displayName>CAN_F13B1</displayName>
  <description>CAN_F13B1</description>
  <addressOffset>0x2a8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_F13B2</name>
  <displayName>CAN_F13B2</displayName>
  <description>CAN_F13B2</description>
  <addressOffset>0x2ac</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FBC</name>
      <description>FBC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
</registers>
</peripheral>

<peripheral derivedFrom="CAN1">
    <name>CAN2</name>
    <baseAddress>0x40006800</baseAddress>
    <interrupt>
        <name>CAN2_TX</name>
        <description>CAN2 TX interrupts</description>
        <value>63</value>
    </interrupt>
    <interrupt>
        <name>CAN2_RX0</name>
        <description>CAN2 RX0 interrupts</description>
        <value>64</value>
    </interrupt>
    <interrupt>
        <name>CAN2_RX1</name>
        <description>CAN2 RX1 interrupts</description>
        <value>65</value>
    </interrupt>
    <interrupt>
        <name>CAN2_SCE</name>
        <description>CAN2 SCE interrupt</description>
        <value>66</value>
    </interrupt>
</peripheral>

<peripheral>
    <name>CRC</name>
    <description>cyclic redundancy check</description>
    <groupName>CRC</groupName>
    <baseAddress>0x40023000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>CRC32DAT</name>
  <displayName>CRC32DAT</displayName>
  <description>CRC32DAT</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CRC32DAT</name>
      <description>CRC32DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC32IDAT</name>
  <displayName>CRC32IDAT</displayName>
  <description>CRC32IDAT</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>CRC32IDAT</name>
      <description>CRC32IDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC32CTRL</name>
  <displayName>CRC32CTRL</displayName>
  <description>CRC32CTRL</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>RESET</name>
      <description>RESET</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16CTRL</name>
  <displayName>CRC16CTRL</displayName>
  <description>CRC16CTRL</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>ENDHL</name>
      <description>ENDHL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLR</name>
      <description>CLR</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16DAT</name>
  <displayName>CRC16DAT</displayName>
  <description>CRC16DAT</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>CRC16DAT</name>
      <description>CRC16DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CRC16D</name>
  <displayName>CRC16D</displayName>
  <description>CRC16D</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CRC16D</name>
      <description>CRC16D</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>LRC</name>
  <displayName>LRC</displayName>
  <description>LRC</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>LRCDAT</name>
      <description>LRCDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
