ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>DMA_CHCFG8</name>
  <displayName>DMA_CHCFG8</displayName>
  <description>DMA_CHCFG8</description>
  <addressOffset>0x94</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM8</name>
  <displayName>DMA_TXNUM8</displayName>
  <description>DMA_TXNUM8</description>
  <addressOffset>0x98</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR8</name>
  <displayName>DMA_PADDR8</displayName>
  <description>DMA_PADDR8</description>
  <addressOffset>0x9c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR8</name>
  <displayName>DMA_MADDR8</displayName>
  <description>DMA_MADDR8</description>
  <addressOffset>0xa0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL8</name>
  <displayName>DMA_CHSEL8</displayName>
  <description>DMA_CHSEL8</description>
  <addressOffset>0xa4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHMAPEN</name>
  <displayName>DMA_CHMAPEN</displayName>
  <description>DMA_CHMAPEN</description>
  <addressOffset>0xa8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>MAP_EN</name>
      <description>MAP_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>GPIOA</name>
    <description>General purpose I/O</description>
    <groupName>GPIO</groupName>
    <baseAddress>0x40010800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
<register>
  <name>GPIOx_PL_CFG</name>
  <displayName>GPIOx_PL_CFG</displayName>
  <description>GPIOx_PL_CFG</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00080800</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>PMODE0</name>
      <description>PMODE0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG0</name>
      <description>PCFG0</description>
      <bitOffset>2</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE1</name>
      <description>PMODE1</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG1</name>
      <description>PCFG1</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE2</name>
      <description>PMODE2</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG2</name>
      <description>PCFG2</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE3</name>
      <description>PMODE3</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG3</name>
      <description>PCFG3</description>
      <bitOffset>14</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE4</name>
      <description>PMODE4</description>
      <bitOffset>16</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG4</name>
      <description>PCFG4</description>
      <bitOffset>18</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE5</name>
      <description>PMODE5</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG5</name>
      <description>PCFG5</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE6</name>
      <description>PMODE6</description>
      <bitOffset>24</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG6</name>
      <description>PCFG6</description>
      <bitOffset>26</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE7</name>
      <description>PMODE7</description>
      <bitOffset>28</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG7</name>
      <description>PCFG7</description>
      <bitOffset>30</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_PH_CFG</name>
  <displayName>GPIOx_PH_CFG</displayName>
  <description>GPIOx_PH_CFG</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x88800000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>PMODE8</name>
      <description>PMODE8</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG8</name>
      <description>PCFG8</description>
      <bitOffset>2</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE9</name>
      <description>PMODE9</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG9</name>
      <description>PCFG9</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE10</name>
      <description>PMODE10</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG10</name>
      <description>PCFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE11</name>
      <description>PMODE11</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG11</name>
      <description>PCFG11</description>
      <bitOffset>14</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE12</name>
      <description>PMODE12</description>
      <bitOffset>16</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG12</name>
      <description>PCFG12</description>
      <bitOffset>18</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE13</name>
      <description>PMODE13</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG13</name>
      <description>PCFG13</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE14</name>
      <description>PMODE14</description>
      <bitOffset>24</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG14</name>
      <description>PCFG14</description>
      <bitOffset>26</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PMODE15</name>
      <description>PMODE15</description>
      <bitOffset>28</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCFG15</name>
      <description>PCFG15</description>
      <bitOffset>30</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_PID</name>
  <displayName>GPIOx_PID</displayName>
  <description>GPIOx_PID</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>PID0</name>
      <description>PID0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID1</name>
      <description>PID1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID2</name>
      <description>PID2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID3</name>
      <description>PID3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID4</name>
      <description>PID4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID5</name>
      <description>PID5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID6</name>
      <description>PID6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID7</name>
      <description>PID7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID8</name>
      <description>PID8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID9</name>
      <description>PID9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID10</name>
      <description>PID10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID11</name>
      <description>PID11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID12</name>
      <description>PID12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID13</name>
      <description>PID13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID14</name>
      <description>PID14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PID15</name>
      <description>PID15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_POD</name>
  <displayName>GPIOx_POD</displayName>
  <description>GPIOx_POD</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000a000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>POD0</name>
      <description>POD0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD1</name>
      <description>POD1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD2</name>
      <description>POD2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD3</name>
      <description>POD3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD4</name>
      <description>POD4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD5</name>
      <description>POD5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD6</name>
      <description>POD6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD7</name>
      <description>POD7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD8</name>
      <description>POD8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD9</name>
      <description>POD9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD10</name>
      <description>POD10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD11</name>
      <description>POD11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD12</name>
      <description>POD12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD13</name>
      <description>POD13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD14</name>
      <description>POD14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>POD15</name>
      <description>POD15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_PBSC</name>
  <displayName>GPIOx_PBSC</displayName>
  <description>GPIOx_PBSC</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>PBS0</name>
      <description>PBS0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS1</name>
      <description>PBS1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS2</name>
      <description>PBS2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS3</name>
      <description>PBS3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS4</name>
      <description>PBS4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS5</name>
      <description>PBS5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS6</name>
      <description>PBS6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS7</name>
      <description>PBS7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS8</name>
      <description>PBS8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS9</name>
      <description>PBS9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS10</name>
      <description>PBS10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS11</name>
      <description>PBS11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS12</name>
      <description>PBS12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS13</name>
      <description>PBS13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS14</name>
      <description>PBS14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBS15</name>
      <description>PBS15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC0</name>
      <description>PBC0</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC1</name>
      <description>PBC1</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC2</name>
      <description>PBC2</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC3</name>
      <description>PBC3</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC4</name>
      <description>PBC4</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC5</name>
      <description>PBC5</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC6</name>
      <description>PBC6</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC7</name>
      <description>PBC7</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC8</name>
      <description>PBC8</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC9</name>
      <description>PBC9</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC10</name>
      <description>PBC10</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC11</name>
      <description>PBC11</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC12</name>
      <description>PBC12</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC13</name>
      <description>PBC13</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC14</name>
      <description>PBC14</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC15</name>
      <description>PBC15</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
