ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>GPIOx_PBC</name>
  <displayName>GPIOx_PBC</displayName>
  <description>GPIOx_PBC</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>PBC0</name>
      <description>PBC0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC1</name>
      <description>PBC1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC2</name>
      <description>PBC2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC3</name>
      <description>PBC3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC4</name>
      <description>PBC4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC5</name>
      <description>PBC5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC6</name>
      <description>PBC6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC7</name>
      <description>PBC7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC8</name>
      <description>PBC8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC9</name>
      <description>PBC9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC10</name>
      <description>PBC10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC11</name>
      <description>PBC11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC12</name>
      <description>PBC12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC13</name>
      <description>PBC13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC14</name>
      <description>PBC14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBC15</name>
      <description>PBC15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_PLOCK_CFG</name>
  <displayName>GPIOx_PLOCK_CFG</displayName>
  <description>GPIOx_PLOCK_CFG</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0001ffff</resetMask>
  <fields>
    <field>
      <name>PLOCK_CFG0</name>
      <description>PLOCK_CFG0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG1</name>
      <description>PLOCK_CFG1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG2</name>
      <description>PLOCK_CFG2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG3</name>
      <description>PLOCK_CFG3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG4</name>
      <description>PLOCK_CFG4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG5</name>
      <description>PLOCK_CFG5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG6</name>
      <description>PLOCK_CFG6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG7</name>
      <description>PLOCK_CFG7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG8</name>
      <description>PLOCK_CFG8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG9</name>
      <description>PLOCK_CFG9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG10</name>
      <description>PLOCK_CFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG11</name>
      <description>PLOCK_CFG11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG12</name>
      <description>PLOCK_CFG12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG13</name>
      <description>PLOCK_CFG13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG14</name>
      <description>PLOCK_CFG14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCK_CFG15</name>
      <description>PLOCK_CFG15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLOCKK_CFG</name>
      <description>PLOCKK_CFG</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_DS_CFG</name>
  <displayName>GPIOx_DS_CFG</displayName>
  <description>GPIOx_DS_CFG</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000f03f</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DS_CFG0</name>
      <description>DS_CFG0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG1</name>
      <description>DS_CFG1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG2</name>
      <description>DS_CFG2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG3</name>
      <description>DS_CFG3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG4</name>
      <description>DS_CFG4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG5</name>
      <description>DS_CFG5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG6</name>
      <description>DS_CFG6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG7</name>
      <description>DS_CFG7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG8</name>
      <description>DS_CFG8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG9</name>
      <description>DS_CFG9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG10</name>
      <description>DS_CFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG11</name>
      <description>DS_CFG11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG12</name>
      <description>DS_CFG12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG13</name>
      <description>DS_CFG13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG14</name>
      <description>DS_CFG14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG15</name>
      <description>DS_CFG15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_SR_CFG</name>
  <displayName>GPIOx_SR_CFG</displayName>
  <description>GPIOx_SR_CFG</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000023f</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>SR_CFG0</name>
      <description>SR_CFG0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG1</name>
      <description>SR_CFG1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG2</name>
      <description>SR_CFG2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG3</name>
      <description>SR_CFG3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG4</name>
      <description>SR_CFG4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG5</name>
      <description>SR_CFG5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG6</name>
      <description>SR_CFG6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG7</name>
      <description>SR_CFG7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG8</name>
      <description>SR_CFG8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG9</name>
      <description>SR_CFG9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG10</name>
      <description>SR_CFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG11</name>
      <description>SR_CFG11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG12</name>
      <description>SR_CFG12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG13</name>
      <description>SR_CFG13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG14</name>
      <description>SR_CFG14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG15</name>
      <description>SR_CFG15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
