ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
</registers>

</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOB</name>
    <baseAddress>0x40010C00</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOC</name>
    <baseAddress>0x40011000</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOD</name>
    <baseAddress>0x40011400</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOE</name>
    <baseAddress>0x40011800</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOF</name>
    <baseAddress>0x40011C00</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOG</name>
    <baseAddress>0x40012000</baseAddress>
</peripheral>

<peripheral>
    <name>AFIO</name>
    <description>Alternate function I/O</description>
    <groupName>AFIO</groupName>
    <baseAddress>0x40010000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>AFIO_ECTRL</name>
  <displayName>AFIO_ECTRL</displayName>
  <description>AFIO_ECTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>PIN_SEL</name>
      <description>PIN_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>PORT_SEL</name>
      <description>PORT_SEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>EOE</name>
      <description>EOE</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_RMP_CFG</name>
  <displayName>AFIO_RMP_CFG</displayName>
  <description>AFIO_RMP_CFG</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x079fffff</resetMask>
  <fields>
    <field>
      <name>SPI1_RMP_0</name>
      <description>SPI1_RMP_0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C1_RMP</name>
      <description>I2C1_RMP</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART1_RMP</name>
      <description>USART1_RMP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART2_RMP_0</name>
      <description>USART2_RMP_0</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART3_RMP</name>
      <description>USART3_RMP</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TIM1_RMP</name>
      <description>TIM1_RMP</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TIM2_RMP</name>
      <description>TIM2_RMP</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TIM3_RMP</name>
      <description>TIM3_RMP</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TIM4_RMP</name>
      <description>TIM4_RMP</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN1_RMP</name>
      <description>CAN1_RMP</description>
      <bitOffset>13</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PD01_RMP</name>
      <description>PD01_RMP</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM5CH4_RMP</name>
      <description>TIM5CH4_RMP</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC1_ETRI</name>
      <description>ADC1_ETRI</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC1_ETRR</name>
      <description>ADC1_ETRR</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC2_ETRI</name>
      <description>ADC2_ETRI</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC2_ETRR</name>
      <description>ADC2_ETRR</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MII_RMII_SEL</name>
      <description>MII_RMII_SEL</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SW_JTAG_CFG</name>
      <description>SW_JTAG_CFG</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_EXTI_CFG1</name>
  <displayName>AFIO_EXTI_CFG1</displayName>
  <description>AFIO_EXTI_CFG1</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EXTI0_CFG</name>
      <description>EXTI0_CFG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI1_CFG</name>
      <description>EXTI1_CFG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI2_CFG</name>
      <description>EXTI2_CFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI3_CFG</name>
      <description>EXTI3_CFG</description>
      <bitOffset>12</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_EXTI_CFG2</name>
  <displayName>AFIO_EXTI_CFG2</displayName>
  <description>AFIO_EXTI_CFG2</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EXTI4_CFG</name>
      <description>EXTI4_CFG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI5_CFG</name>
      <description>EXTI5_CFG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI6_CFG</name>
      <description>EXTI6_CFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI7_CFG</name>
      <description>EXTI7_CFG</description>
      <bitOffset>12</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_EXTI_CFG3</name>
  <displayName>AFIO_EXTI_CFG3</displayName>
  <description>AFIO_EXTI_CFG3</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EXTI8_CFG</name>
      <description>EXTI8_CFG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI9_CFG</name>
      <description>EXTI9_CFG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI10_CFG</name>
      <description>EXTI10_CFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI11_CFG</name>
      <description>EXTI11_CFG</description>
      <bitOffset>12</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_EXTI_CFG4</name>
  <displayName>AFIO_EXTI_CFG4</displayName>
  <description>AFIO_EXTI_CFG4</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EXTI12_CFG</name>
      <description>EXTI12_CFG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI13_CFG</name>
      <description>EXTI13_CFG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI14_CFG</name>
      <description>EXTI14_CFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTI15_CFG</name>
      <description>EXTI15_CFG</description>
      <bitOffset>12</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_RMP_CFG3</name>
  <displayName>AFIO_RMP_CFG3</displayName>
  <description>AFIO_RMP_CFG3</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xfffffff7</resetMask>
  <fields>
    <field>
      <name>SDIO_RMP</name>
      <description>SDIO_RMP</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN2_RMP</name>
      <description>CAN2_RMP</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>QSPI_RMP</name>
      <description>QSPI_RMP</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>I2C2_RMP</name>
      <description>I2C2_RMP</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>I2C3_RMP</name>
      <description>I2C3_RMP</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>I2C4_RMP</name>
      <description>I2C4_RMP</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SPI2_RMP</name>
      <description>SPI2_RMP</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SPI3_RMP</name>
      <description>SPI3_RMP</description>
      <bitOffset>14</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>ETH_RMP</name>
      <description>ETH_RMP</description>
      <bitOffset>16</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SPI1_RMP_1</name>
      <description>SPI1_RMP_1</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART2_RMP_1</name>
      <description>USART2_RMP_1</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART4_RMP</name>
      <description>UART4_RMP</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>UART5_RMP</name>
      <description>UART5_RMP</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>UART6_RMP</name>
      <description>UART6_RMP</description>
      <bitOffset>24</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>UART7_RMP</name>
      <description>UART7_RMP</description>
      <bitOffset>26</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TIM8_RMP</name>
      <description>TIM8_RMP</description>
      <bitOffset>30</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_RMP_CFG4</name>
  <displayName>AFIO_RMP_CFG4</displayName>
  <description>AFIO_RMP_CFG4</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x03ffdfff</resetMask>
  <fields>
    <field>
      <name>COMP1_RMP</name>
      <description>COMP1_RMP</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP2_RMP</name>
      <description>COMP2_RMP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP3_RMP</name>
      <description>COMP3_RMP</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP4_RMP</name>
      <description>COMP4_RMP</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP5_RMP</name>
      <description>COMP5_RMP</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP6_RMP</name>
      <description>COMP6_RMP</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COMP7_RMP</name>
      <description>COMP7_RMP</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC3_ETRI</name>
      <description>ADC3_ETRI</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC3_ETRR</name>
      <description>ADC3_ETRR</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC4_ETRI</name>
      <description>ADC4_ETRI</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC4_ETRR</name>
      <description>ADC4_ETRR</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSC_OUT_CTRL</name>
      <description>TSC_OUT_CTRL</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>QSPI_XIP_EN</name>
      <description>QSPI_XIP_EN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DVP_RMP</name>
      <description>DVP_RMP</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SPI1_NSS</name>
      <description>SPI1_NSS</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI2_NSS</name>
      <description>SPI2_NSS</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI3_NSS</name>
      <description>SPI3_NSS</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>QSPI_MISO</name>
      <description>QSPI_MISO</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>AFIO_RMP_CFG5</name>
  <displayName>AFIO_RMP_CFG5</displayName>
  <description>AFIO_RMP_CFG5</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>ECLAMP1_RST_EN</name>
      <description>ECLAMP1_RST_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP2_RST_EN</name>
      <description>ECLAMP2_RST_EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP3_RST_EN</name>
      <description>ECLAMP3_RST_EN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP4_RST_EN</name>
      <description>ECLAMP4_RST_EN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN1_RST_EN</name>
      <description>EGBN1_RST_EN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN2_RST_EN</name>
      <description>EGBN2_RST_EN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN3_RST_EN</name>
      <description>EGBN3_RST_EN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN4_RST_EN</name>
      <description>EGBN4_RST_EN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB1_RST_EN</name>
      <description>EGB1_RST_EN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB2_RST_EN</name>
      <description>EGB2_RST_EN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB3_RST_EN</name>
      <description>EGB3_RST_EN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB4_RST_EN</name>
      <description>EGB4_RST_EN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP1_DET_EN</name>
      <description>ECLAMP1_DET_EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP2_DET_EN</name>
      <description>ECLAMP2_DET_EN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP3_DET_EN</name>
      <description>ECLAMP3_DET_EN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECLAMP4_DET_EN</name>
      <description>ECLAMP4_DET_EN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN1_DET_EN</name>
      <description>EGBN1_DET_EN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN2_DET_EN</name>
      <description>EGBN2_DET_EN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN3_DET_EN</name>
      <description>EGBN3_DET_EN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGBN4_DET_EN</name>
      <description>EGBN4_DET_EN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB1_DETEN</name>
      <description>EGB1_DETEN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB2_DET_EN</name>
      <description>EGB2_DET_EN</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB3_DET_EN</name>
      <description>EGB3_DET_EN</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EGB4_DET_EN</name>
      <description>EGB4_DET_EN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
