ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
</registers>

</peripheral>

<peripheral>
    <name>IWDG</name>
    <description>Independent watchdog</description>
    <groupName>IWDG</groupName>
    <baseAddress>0x40003000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>IWDG_KEY</name>
  <displayName>IWDG_KEY</displayName>
  <description>IWDG_KEY</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>KEYV</name>
      <description>KEYV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_PREDIV</name>
  <displayName>IWDG_PREDIV</displayName>
  <description>IWDG_PREDIV</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>PD</name>
      <description>PD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_RELV</name>
  <displayName>IWDG_RELV</displayName>
  <description>IWDG_RELV</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000fff</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>REL</name>
      <description>REL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_STS</name>
  <displayName>IWDG_STS</displayName>
  <description>IWDG_STS</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>PVU</name>
      <description>PVU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRVU</name>
      <description>CRVU</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>PWR</name>
    <description>Power control</description>
    <groupName>PWR</groupName>
    <baseAddress>0x40007000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>PVD</name>
        <description>PVD through EXTI line detection interrupt</description>
        <value>1</value>
    </interrupt>
    <registers>
<register>
  <name>PWR_CTRL1</name>
  <displayName>PWR_CTRL1</displayName>
  <description>PWR_CTRL1</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>__LPS</name>
      <description>__LPS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__PDS</name>
      <description>__PDS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__CWKUP</name>
      <description>__CWKUP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__CSBVBAT</name>
      <description>__CSBVBAT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__PVDEN</name>
      <description>__PVDEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PRS</name>
      <description>PRS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>DBKP</name>
      <description>DBKP</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MSB</name>
      <description>MSB</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRLSTS</name>
  <displayName>PWR_CTRLSTS</displayName>
  <description>PWR_CTRLSTS</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000010f</resetMask>
  <fields>
    <field>
      <name>WKUPF</name>
      <description>WKUPF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SBF</name>
      <description>SBF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVDO</name>
      <description>PVDO</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VBATF</name>
      <description>VBATF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUPEN</name>
      <description>WKUPEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL2</name>
  <displayName>PWR_CTRL2</displayName>
  <description>PWR_CTRL2</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x000006e4</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>__STOP2S</name>
      <description>__STOP2S</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR2VBRET</name>
      <description>SR2VBRET</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR2STBRET</name>
      <description>SR2STBRET</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TMPWPEN</name>
      <description>TMPWPEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSITRIM</name>
      <description>LSITRIM</description>
      <bitOffset>4</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>IWDGWPEN</name>
      <description>IWDGWPEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IWDGRSTEN</name>
      <description>IWDGRSTEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL3</name>
  <displayName>PWR_CTRL3</displayName>
  <description>PWR_CTRL3</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00045b70</resetValue>
  <resetMask>0x0007ffff</resetMask>
  <fields>
    <field>
      <name>BKPM</name>
      <description>BKPM</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRTR</name>
      <description>MRTR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>BKRTR</name>
      <description>BKRTR</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>VDBKPORTR</name>
      <description>VDBKPORTR</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BKRBSTR</name>
      <description>BKRBSTR</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>BKRCTRL</name>
      <description>BKRCTRL</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRLPTR</name>
      <description>MRLPTR</description>
      <bitOffset>15</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL4</name>
  <displayName>PWR_CTRL4</displayName>
  <description>PWR_CTRL4</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000141</resetValue>
  <resetMask>0x000001ff</resetMask>
  <fields>
    <field>
      <name>CTR</name>
      <description>CTR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>AGCC</name>
      <description>AGCC</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BSTR</name>
      <description>BSTR</description>
      <bitOffset>3</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>BUFFTRV</name>
      <description>BUFFTRV</description>
      <bitOffset>7</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL5</name>
  <displayName>PWR_CTRL5</displayName>
  <description>PWR_CTRL5</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x000007ff</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>MRCEN</name>
      <description>MRCEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRLPEN</name>
      <description>MRLPEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FLSLMCEN</name>
      <description>FLSLMCEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FLPDMCEN</name>
      <description>FLPDMCEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLCEN</name>
      <description>PLLCEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSICEN</name>
      <description>HSICEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSECEN</name>
      <description>HSECEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVSCEN</name>
      <description>PVSCEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVSRETCEN</name>
      <description>PVSRETCEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SRCEN</name>
      <description>SRCEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BGCEN</name>
      <description>BGCEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL6</name>
  <displayName>PWR_CTRL6</displayName>
  <description>PWR_CTRL6</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>LSEEN</name>
      <description>LSEEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEBYPSEL</name>
      <description>LSEBYPSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEBUFFSEL</name>
      <description>LSEBUFFSEL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEBTRSEL</name>
      <description>LSEBTRSEL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEAGSEL</name>
      <description>LSEAGSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEDRVTRSEL</name>
      <description>LSEDRVTRSEL</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIEN</name>
      <description>LSIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSITRSEL</name>
      <description>LSITRSEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKRCSEL</name>
      <description>BKRCSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKRTRSEL</name>
      <description>BKRTRSEL</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKRBSTRSEL</name>
      <description>BKRBSTRSEL</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKRPORTRSEL</name>
      <description>BKRPORTRSEL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DBGENSEL</name>
      <description>DBGENSEL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PA0WPEN</name>
      <description>PA0WPEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SW2EN</name>
      <description>SW2EN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SW3EN</name>
      <description>SW3EN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MREN</name>
      <description>MREN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRLPEN</name>
      <description>MRLPEN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BGEN</name>
      <description>BGEN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVDEN</name>
      <description>PVDEN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVDSEL</name>
      <description>PVDSEL</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRTRSEL</name>
      <description>MRTRSEL</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRLPTRSEL</name>
      <description>MRLPTRSEL</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FLCSEL</name>
      <description>FLCSEL</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCEN</name>
      <description>TSCEN</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCPADSEL</name>
      <description>TSCPADSEL</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCIBSEL</name>
      <description>TSCIBSEL</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCSPSEL</name>
      <description>TSCSPSEL</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCRSEL</name>
      <description>TSCRSEL</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSC_MUXSEL</name>
      <description>TSC_MUXSEL</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCIBTEN</name>
      <description>TSCIBTEN</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCTSEL</name>
      <description>TSCTSEL</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL7</name>
  <displayName>PWR_CTRL7</displayName>
  <description>PWR_CTRL7</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000001</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>PVSCSEL</name>
      <description>PVSCSEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
