ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G4FR/N32G4FR.svd
<register>
  <name>TSC_THRHD21</name>
  <displayName>TSC_THRHD21</displayName>
  <description>TSC_THRHD21</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE21</name>
      <description>BASE21</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA21</name>
      <description>DELTA21</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD22</name>
  <displayName>TSC_THRHD22</displayName>
  <description>TSC_THRHD22</description>
  <addressOffset>0x7c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE22</name>
      <description>BASE22</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA22</name>
      <description>DELTA22</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD23</name>
  <displayName>TSC_THRHD23</displayName>
  <description>TSC_THRHD23</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE23</name>
      <description>BASE23</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA23</name>
      <description>DELTA23</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>DVP</name>
    <description>Digital video port</description>
    <groupName>DVP</groupName>
    <baseAddress>0x40014C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>DVP</name>
        <description>DVP interrupt</description>
        <value>78</value>
    </interrupt>
                <registers>
<register>
  <name>DVP_CTRL</name>
  <displayName>DVP_CTRL</displayName>
  <description>DVP_CTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00004000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CAPTURE</name>
      <description>CAPTURE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CM</name>
      <description>CM</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSPOL</name>
      <description>HSPOL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VSPOL</name>
      <description>VSPOL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PCKPOL</name>
      <description>PCKPOL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATINV</name>
      <description>DATINV</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BSM</name>
      <description>BSM</description>
      <bitOffset>6</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>LSM</name>
      <description>LSM</description>
      <bitOffset>9</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>FWM</name>
      <description>FWM</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>FFSWRST</name>
      <description>FFSWRST</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_STS</name>
  <displayName>DVP_STS</displayName>
  <description>DVP_STS</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000000f</resetMask>
  <fields>
    <field>
      <name>FNE</name>
      <description>FNE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FCNT</name>
      <description>FCNT</description>
      <bitOffset>1</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_INTSTS</name>
  <displayName>DVP_INTSTS</displayName>
  <description>DVP_INTSTS</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000010</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>FMSIS</name>
      <description>FMSIS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FMEIS</name>
      <description>FMEIS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIS</name>
      <description>LSIS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LEIS</name>
      <description>LEIS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FEIS</name>
      <description>FEIS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFIS</name>
      <description>FFIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FWIS</name>
      <description>FWIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FOIS</name>
      <description>FOIS</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VERRIS</name>
      <description>VERRIS</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HERRIS</name>
      <description>HERRIS</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_INTEN</name>
  <displayName>DVP_INTEN</displayName>
  <description>DVP_INTEN</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>FMSIE</name>
      <description>FMSIE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FMEIE</name>
      <description>FMEIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIE</name>
      <description>LSIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LEIE</name>
      <description>LEIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FEIE</name>
      <description>FEIE</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFIE</name>
      <description>FFIE</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FWIE</name>
      <description>FWIE</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FOIE</name>
      <description>FOIE</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VERRIE</name>
      <description>VERRIE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HERRIE</name>
      <description>HERRIE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMAEN</name>
      <description>DMAEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_MINTSTS</name>
  <displayName>DVP_MINTSTS</displayName>
  <description>DVP_MINTSTS</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>FMSMIS</name>
      <description>FMSMIS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FMEMIS</name>
      <description>FMEMIS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSMIS</name>
      <description>LSMIS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LEMIS</name>
      <description>LEMIS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FEMIS</name>
      <description>FEMIS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFMIS</name>
      <description>FFMIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FWMIS</name>
      <description>FWMIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FOMIS</name>
      <description>FOMIS</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VERRMIS</name>
      <description>VERRMIS</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HERRMIS</name>
      <description>HERRMIS</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_WST</name>
  <displayName>DVP_WST</displayName>
  <description>DVP_WST</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffe7ff</resetMask>
  <fields>
    <field>
      <name>HST</name>
      <description>HST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>VST</name>
      <description>VST</description>
      <bitOffset>13</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_WSIZE</name>
  <displayName>DVP_WSIZE</displayName>
  <description>DVP_WSIZE</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffe7ff</resetMask>
  <fields>
    <field>
      <name>HCNT</name>
      <description>HCNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>VLINE</name>
      <description>VLINE</description>
      <bitOffset>13</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DVP_FIFO</name>
  <displayName>DVP_FIFO</displayName>
  <description>DVP_FIFO</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DAT0</name>
      <description>DAT0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DAT1</name>
      <description>DAT1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DAT2</name>
      <description>DAT2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DAT3</name>
      <description>DAT3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
